[
  {
    "date": "2025-11-12T16:00:00.000Z",
    "title": "A sad story",
    "content": "This is a sad story. We all know that Cullinan Park had two different duck species that were very good friends. They lived in the park together, eating together, sleeping together, doing everything side by side. But one day, I saw only one duck sitting there alone. I thought maybe something had happened to the other one, but I really hoped it wasn?t true.\n\nReality can be cruel? We later found bones, and others said they had seen a raccoon eating that duck. Now the remaining duck has to live on its own, lonely and without its friend...",
    "image": "https://i.imgur.com/IiuhIBa.jpeg\nhttps://i.imgur.com/k6XpzwC.jpeg"
  },
  {
    "date": "2025-11-10T16:00:00.000Z",
    "title": "Cullianan never falis us",
    "content": "cullinan is a very very amazing place, I observed all below spicies through out my weekly visits there (from July to Nov):\nBald Eagle, Red-shoudered Hawk, Broad-winged Hawk, Snail Kite, Indigo Bunting, American Pipit, Yellow-billed Cuckoo, Lincon's Sparrow, Vesper Sparrow, Limpkin, Solitary Sandpiper, Least Sandpiper, Long-billded Dowitcher, Willson's Snipe, Great Yellowlegs, White-eyed Vireo, Blue-gray Gnatcatcher, Red-crowned Kinglet, Wilson's Warbler, Black-and-white Warbler, Yellow Warbler, Yellow-rumped Warbler...\nAnd the list is still going on...",
    "image": "https://i.imgur.com/d2wA2HR.png"
  },
  {
    "date": "2025-07-27T16:00:00.000Z",
    "title": "Wow... Poop Rain?",
    "content": "The sky is filled with Purple Martins, poopping out like raindrops falling on everyone. But can you imagine? Soon, these tiny creatures will travel more than 10,000 miles all the way to Brazil. Why not just stop in Mexico, where the weather is also warm?\n\nI made some research and the answer amazed me -- they don't stay in Mexico because they want to avoid competition. Brazil offers them more food, more space, and greater safety. I look up at the sky again, and suddenly, I feel a deep sympathy for them.",
    "image": "https://i.imgur.com/ehWdDSS.mp4"
  },
  {
    "date": "2025-10-12T16:00:00.000Z",
    "title": "The Last Supper",
    "content": "Look! A whole flock of Black Vultures is gathered by the roadside, tearing at a dead animal. Their wings flap and their calls echo as they fight over every piece. It's a bit horrifying to watch -- they show no hesitation, no mercy, just hunger. Be careful, if you drive too fast, you might run over some of them. That will be their LAST SUPPER.",
    "image": "https://i.imgur.com/uijU3ZE.jpeg\nhttps://i.imgur.com/gDemac4.jpeg\n"
  },
  {
    "date": "2025-10-10T16:00:00.000Z",
    "title": "Who's snack is it?",
    "content": "Today, when I was cleaning the pictures, I noticed something interesting. This Easten Phoebe is sitting by a dried lizard, is it the snack of the Phoebe? But I know the phoebes eat insects, and their beaks are too weak to catch lizards. Then whoes snack is it?\n\nI shared this finding with my mom, and we both came up with the same guess -- Shrike, the famouse butcher bird!",
    "image": "https://i.imgur.com/L1HVeKu.jpeg"
  },
  {
    "date": "2025-10-07T16:00:00.000Z",
    "title": "Scissor-tailed Flycatcher",
    "content": "It's been 2 weeks when my mom and I tried to find it! We checked in eBird and facebook for its records, we went to different parks for its presence, but all failed. Today, in our backyard, when I looked up the sky, I saw a bird with a long tail flying by. It's it! The Scissor-tailed Flycatcher. We rushed out with camera, running to our neighbor's house, where there's a tree it rested on. And I'm lucky enough to take a beautiful photo of it.\nI feel so excited this time, the bird we spent long time to find, is in our backyard!",
    "image": "https://i.imgur.com/yJl8ZUM.jpeg\nhttps://i.imgur.com/TbZe3hr.jpeg"
  },
  {
    "date": "2025-07-18T16:00:00.000Z",
    "title": "Glassy-winged Sharpshooter",
    "content": "One day, my mom and I spotted an interesting insect on the stem of a plant. When we approached it, it teleported to avoid us. When we turned left, it instantly moved to the right side of the stem, and when we turned right, it moved to the left. It moved so fast that we couldn't tell if it was hopping or crawling.\n\nHow did it detect and even predict our movements? Was it the light and shadows it saw with its eyes, or the sounds it heard with its ears, or some uncanny sixth sense?",
    "image": "https://i.imgur.com/sHmKTHE.mp4"
  }
]